In [1]:
### PREPARE DF FOR DARK SKY API ######
import sqlite3
conn = sqlite3.connect('database.sqlite')
c = conn.cursor()

import pandas as pd
import seaborn as sns

c.execute('''SELECT * FROM Matches WHERE season = 2011;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df.head()

992

   Match_ID Div  Season        Date   HomeTeam       AwayTeam  FTHG  FTAG FTR
0      1092  D1    2011  2012-03-31   Nurnberg  Bayern Munich     0     1   A
1      1093  D1    2011  2011-12-11  Stuttgart  Bayern Munich     1     2   A
2      1094  D1    2011  2011-08-13  Wolfsburg  Bayern Munich     0     1   A
3      1095  D1    2011  2011-11-27      Mainz  Bayern Munich     3     2   H
4      1096  D1    2011  2012-02-18   Freiburg  Bayern Munich     0     0   D

In [2]:
# Remove unwanted columns #
df.drop(['Div','FTHG','FTAG','FTR','AwayTeam','HomeTeam','Season'],axis = 1, inplace = True)

In [3]:
df.head()

   Match_ID        Date
0      1092  2012-03-31
1      1093  2011-12-11
2      1094  2011-08-13
3      1095  2011-11-27
4      1096  2012-02-18

In [9]:
df.set_index('Match_ID',inplace = True)

In [10]:
weather_df = df

In [11]:
weather_df.head()

                Date
Match_ID
1092      1333152000
1093      1323561600
1094      1313193600
1095      1322352000
1096      1329523200

In [7]:
#change date to unix date time for use in api call
df['Date'] = pd.to_datetime(df['Date'])
df['Date'] = (df['Date'] - pd.Timestamp("1970-01-01")) // pd.Timedelta('1s')

In [12]:
weather_df.head()

                Date
Match_ID
1092      1333152000
1093      1323561600
1094      1313193600
1095      1322352000
1096      1329523200

In [20]:
#
weather_df.sort_values(by = 'Date',inplace = True)
weather_df.

                Date
Match_ID
1133      1310688000
1167      1310688000
1551      1310688000
1678      1310774400
1550      1310774400

In [28]:
#### WEATHER API #####
print(weather_df.Date)

Match_ID
1133     1310688000
1167     1310688000
1551     1310688000
1678     1310774400
1550     1310774400
1442     1310860800
1146     1310860800
1602     1310860800
1360     1310947200
1505     1311292800
1596     1311292800
1667     1311292800
1525     1311379200
1261     1311379200
1699     1311465600
1574     1311465600
1390     1311465600
1463     1311552000
1684     1312502400
1219     1312502400
1613     1312502400
1545     1312502400
1237     1312588800
1194     1312588800
1130     1312588800
1466     1312588800
1292     1312588800
1433     1312588800
1311     1312588800
1648     1312588800
            ...
1270     1336176000
1207     1336176000
1610     1336262400
44862    1336262400
44861    1336262400
44860    1336262400
44859    1336262400
44858    1336262400
1683     1336262400
44856    1336262400
44857    1336262400
1158     1336262400
1135     1336262400
1356     1336262400
1528     1336262400
1540     1336262400
1552     1336262400
1168     1336262400
44863    1336348800
44864    1336435200
44872    1336867200
44871    1336867200
44870    1336867200
44869    1336867200
44865    1336867200
44867    1336867200
44866    1336867200
44873    1336867200
44868    1336867200
44874    1336867200
Name: Date, Length: 992, dtype: int64

In [29]:
#imports for api call
from bs4 import BeautifulSoup
import requests
import json
import pprint
date_test = ['1310688000','1336262400','1336867200']

In [30]:
date_test

['1310688000', '1336262400', '1336867200']

In [40]:
url = 'https://api.darksky.net/forecast/'
API_Key = '7bae2b226c09c124a036c0499d4f4456'
payload = {'key':API_Key,'latitude':"52.52437",'longitude': "13.41053",'time':"1336262400",'exclude':('minutely','hourly','daily','alerts','flags')}

In [41]:
#prep for api call test
# url = 'https://api.darksky.net/forecast/7bae2b226c09c124a036c0499d4f4456/52.52437,13.41053,1333152000?exclude=minutely,hourly,daily,alerts,flags'
# API_Key = '7bae2b226c09c124a036c0499d4f4456'
# payload = {'key':API_Key,'latitude':'52.52437','longitude': '13.41053','time':df['Date'],'exclude': ['minutely','hourly','daily','alerts','flags']}


response = requests.get(url)
print(response)
pprint.pprint(response.text)

<Response [400]>
'{"code":400,"error":"Poorly formatted request"}\n'

In [25]:
#keys from the api call to see what we want
response.json().keys()

dict_keys(['latitude', 'longitude', 'timezone', 'currently', 'offset'])

In [26]:
#call the weather
response.json()['currently']['summary']

'Mostly Cloudy'

In [ ]:
#get weather from list of dates per match id